for i in range(10):
    x=int(input('请输入您的月工资：'))
    if x<100:
        print('sorry，您的工资不符合实际')
    else:
        a = x//100
        y = x-100*a
        if y>=50:
            b=1
            z=y-50
        elif 50>y>=20:
            b=0
            c=y//20
            d=(y-c*20)//10
            e=(y-c*20-d*10)//5
            f=(-c*20-d*10-e*5)
        elif 20>y>=10:
            b=0
            c=0
            d=y//10
            e=(y-d*10)//5
            f=y-d*10-e*5
        elif y<10:
            b=0
            c=0
            d=0
            e=0
            f=y

        b=y//50                     #五十元钞票数
        c=(y-b*50)//20                  #二十元钞票数
        d=(y-b*50-c*20)//10         #十元钞票数
        e=(y-b*50-c*20-d*10)//5     #五元钞票数
        f=(y-b*50-c*20-d*10-e*5)    #一元钞票数



    print('需要给您100元：',a,'张')
    print('需要给您50:',b,'张')
    print('需要给您20元：',c,'张')
    print('需要给您10元：',d,'张')
    print('需要给您5元：',e,'张')
    print('需要给您1元：',f,'张')
    print('总共钞票数：',a+b+c+d+e+f,'张')